# Pandas & Numpy

In [1]:
import pandas as pd
import numpy as np

# DataFrame

In [2]:
Dict={
    "Name":['Ella Khan', 'Lilly' ,'Milli','Alisha','Danish'],
    "City":['Arizona','Etovok','Menchester','Delhi','Islamabad'],
    "Marks":['880','990','789','560','1000'],
    "DoB":['2006','2005','2006','2005','2006'],
  "Contact":["03434567432","03434567430","03430567432","03034567432","03422567332"]
}

In [5]:
df=pd.DataFrame(Dict)

In [7]:
df

        Name        City Marks   DoB      Contact
0  Ella Khan     Arizona   880  2006  03434567432
1      Lilly      Etovok   990  2005  03434567430
2      Milli  Menchester   789  2006  03430567432
3     Alisha       Delhi   560  2005  03034567432
4     Danish   Islamabad  1000  2006  03422567332

In [9]:
#df.to_csv('friends.csv')

In [11]:
df.to_excel('Std.xlsx')

In [12]:
df.to_excel("Std_index_false.xlsx",index=False)

In [13]:
df

        Name        City Marks   DoB      Contact
0  Ella Khan     Arizona   880  2006  03434567432
1      Lilly      Etovok   990  2005  03434567430
2      Milli  Menchester   789  2006  03430567432
3     Alisha       Delhi   560  2005  03034567432
4     Danish   Islamabad  1000  2006  03422567332

In [15]:
df.head()

        Name        City Marks   DoB      Contact
0  Ella Khan     Arizona   880  2006  03434567432
1      Lilly      Etovok   990  2005  03434567430
2      Milli  Menchester   789  2006  03430567432
3     Alisha       Delhi   560  2005  03034567432
4     Danish   Islamabad  1000  2006  03422567332

In [19]:
df.tail(2)

     Name       City Marks   DoB      Contact
3  Alisha      Delhi   560  2005  03034567432
4  Danish  Islamabad  1000  2006  03422567332

In [21]:
df.describe()

             Name     City Marks   DoB      Contact
count           5        5     5     5            5
unique          5        5     5     2            5
top     Ella Khan  Arizona   880  2006  03434567432
freq            1        1     1     3            1

In [23]:
df.shape

(5, 5)

In [25]:
df.describe

<bound method NDFrame.describe of         Name        City Marks   DoB      Contact
0  Ella Khan     Arizona   880  2006  03434567432
1      Lilly      Etovok   990  2005  03434567430
2      Milli  Menchester   789  2006  03430567432
3     Alisha       Delhi   560  2005  03034567432
4     Danish   Islamabad  1000  2006  03422567332>

 # reading the excel file using pandas function

In [31]:
student=pd.read_excel('Pandas/Std_data.xlsx')

In [33]:
student

    name sub   DoB  Class  T.Marks  Obt.Marks
0    ali  CS  2003     10      550        300
1  seena  SE  2003     10      550        350
2   bero  IT  2002     10      550        400
3   lisa  CS  2002     10      550        399
4   nila  SE  2003     10      550        450

In [39]:
student['DoB']

0    2003
1    2003
2    2002
3    2002
4    2003
Name: DoB, dtype: int64

In [49]:
student['name'][0] # checking value at index 0

'ali'

In [53]:
student['DoB'][3]= 2003 # value changed at index 3

C:\Users\eukha\AppData\Local\Temp\ipykernel_12644\2531787687.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student['DoB'][3]= 2003

In [55]:
student

    name sub   DoB  Class  T.Marks  Obt.Marks
0    ali  CS  2003     10      550        300
1  seena  SE  2003     10      550        350
2   bero  IT  2002     10      550        400
3   lisa  CS  2003     10      550        399
4   nila  SE  2003     10      550        450

In [57]:
student =df.to_excel('Std-data.xlsx')

# Series

In [59]:
ser=pd.Series(np.random.rand(34))

In [61]:
ser

0     0.072727
1     0.997310
2     0.856650
3     0.894853
4     0.033121
5     0.468057
6     0.265289
7     0.270506
8     0.026502
9     0.269947
10    0.689245
11    0.620819
12    0.616939
13    0.912630
14    0.386432
15    0.703797
16    0.808374
17    0.435522
18    0.603087
19    0.112091
20    0.224586
21    0.394871
22    0.428369
23    0.987605
24    0.809443
25    0.279993
26    0.167891
27    0.222306
28    0.971524
29    0.097602
30    0.100671
31    0.327087
32    0.115756
33    0.423166
dtype: float64

In [65]:
type(ser)

pandas.core.series.Series

In [79]:
newdf=pd.DataFrame(np.random.rand(334,5), index =np.arange(334))

In [94]:
newdf.head()

          0         1         2         3         4
0  0.254653  0.052572  0.691347  0.003918  0.030833
1  0.350978  0.958463  0.834228  0.688915  0.991380
2  0.732830  0.044039  0.381209  0.686972  0.151180
3  0.864510  0.503403  0.728913  0.942246  0.410693
4  0.516408  0.352756  0.462173  0.922990  0.758476

In [83]:
type(newdf)

pandas.core.frame.DataFrame

In [86]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.496570    0.496964    0.495962    0.495849    0.484372
std      0.292235    0.290391    0.285128    0.295386    0.279248
min      0.003045    0.003295    0.006411    0.000382    0.003107
25%      0.240367    0.230747    0.239415    0.244604    0.257107
50%      0.477275    0.508181    0.503477    0.485906    0.482551
75%      0.758652    0.749596    0.741885    0.742265    0.704174
max      0.999299    0.996740    0.996984    0.998910    0.999809

In [92]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [96]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [100]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

 # Converting to numpy array

In [102]:
newdf.to_numpy()

array([[0.25465289, 0.05257164, 0.69134663, 0.00391815, 0.03083261],
       [0.35097837, 0.95846265, 0.83422758, 0.68891486, 0.99138031],
       [0.73282966, 0.04403895, 0.3812092 , 0.6869718 , 0.15118003],
       ...,
       [0.2261824 , 0.16110276, 0.66431517, 0.71679092, 0.10073308],
       [0.71711863, 0.66735219, 0.16684308, 0.39150506, 0.32800707],
       [0.0937957 , 0.62246715, 0.11990957, 0.42994433, 0.84249794]])

# for taking Transpose

In [104]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.254653,0.350978,0.732830,0.864510,0.516408,0.814061,0.013038,0.716453,0.270968,0.346448,...,0.108172,0.068443,0.306216,0.205068,0.469716,0.855935,0.532952,0.226182,0.717119,0.093796
1,0.052572,0.958463,0.044039,0.503403,0.352756,0.074653,0.855836,0.752277,0.162737,0.813092,...,0.464919,0.956230,0.137913,0.725112,0.775150,0.675470,0.011508,0.161103,0.667352,0.622467
2,0.691347,0.834228,0.381209,0.728913,0.462173,0.085156,0.402200,0.257178,0.851246,0.621110,...,0.649541,0.354368,0.555028,0.319205,0.157925,0.509918,0.094862,0.664315,0.166843,0.119910
3,0.003918,0.688915,0.686972,0.942246,0.922990,0.952173,0.485171,0.243424,0.903888,0.872726,...,0.655207,0.399781,0.935472,0.916055,0.190412,0.799970,0.846448,0.716791,0.391505,0.429944
4,0.030833,0.991380,0.151180,0.410693,0.758476,0.237268,0.219092,0.310129,0.135598,0.363445,...,0.744476,0.705231,0.730431,0.215325,0.943099,0.588989,0.759361,0.100733,0.328007,0.842498